const deviceMap = [
  {
    "id": "6101060050",
    "position": [-940, 0, -1055],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070018",
    "position": [-980, 0, -1055],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070022",
    "position": [-1020, 0, -1055],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070020",
    "position": [-1060, 0, -1055],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060016",
    "position": [-1100, 0, -1075],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060020",
    "position": [-1140, 0, -1075],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060018",
    "position": [-1180, 0, -1075],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070007",
    "position": [-1220, 0, -1075],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070002",
    "position": [-1260, 0, -1075],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070009",
    "position": [-1100, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070005",
    "position": [-1140, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070006",
    "position": [-1180, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070004",
    "position": [-1220, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070017",
    "position": [-1260, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070003",
    "position": [-1300, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070014",
    "position": [-1340, 0, -1045],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101030050",
    "position": [-940, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030049",
    "position": [-940, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030048",
    "position": [-980, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030020",
    "position": [-1030, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030021",
    "position": [-1070, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030083",
    "position": [-1110, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030077",
    "position": [-1150, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030078",
    "position": [-1110, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030076",
    "position": [-1150, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030072",
    "position": [-1210, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030071",
    "position": [-1190, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030025",
    "position": [-1230, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030024",
    "position": [-1270, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030023",
    "position": [-1310, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030022",
    "position": [-1350, 0, -950],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030099",
    "position": [-1310, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030100",
    "position": [-1350, 0, -980],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030038",
    "position": [-940, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030037",
    "position": [-980, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030036",
    "position": [-1020, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030035",
    "position": [-1060, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030040",
    "position": [-1100, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030039",
    "position": [-1140, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030092",
    "position": [-1180, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030125",
    "position": [-1220, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030124",
    "position": [-1260, 0, -860],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6102020007",
    "position": [-980, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102030013",
    "position": [-1020, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102020009",
    "position": [-1060, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102010002",
    "position": [-1040, 0, -750],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102010009",
    "position": [-1080, 0, -750],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "抽钉线"
  },
  {
    "id": "6102020005",
    "position": [-1130, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102020004",
    "position": [-1170, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102010016",
    "position": [-1210, 0, -780],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102030010",
    "position": [-1210, 0, -750],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "抽钉线"
  },
  {
    "id": "6102120080",
    "position": [-940, 0, -680],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6102120079",
    "position": [-940, 0, -650],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6102120056",
    "position": [-980, 0, -680],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6102070005",
    "position": [-1020, 0, -680],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102130001",
    "position": [-1020, 0, -650],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070002",
    "position": [-1060, 0, -650],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102130004",
    "position": [-1100, 0, -650],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102130003",
    "position": [-1140, 0, -650],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070001",
    "position": [-1100, 0, -680],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070011",
    "position": [-1140, 0, -680],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "p-xhc60t-1",
    "position": [-1300, 0, -590],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "p-xhc60t-2",
    "position": [-1300, 0, -560],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6101030067",
    "position": [-980, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030068",
    "position": [-1020, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030069",
    "position": [-1060, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030070",
    "position": [-1100, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030126",
    "position": [-1060, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030127",
    "position": [-1100, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030094",
    "position": [-1140, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101030095",
    "position": [-1180, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101050007",
    "position": [-1160, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101050008",
    "position": [-1200, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6101040014",
    "position": [-1240, 0, -500],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控班"
  },
  {
    "id": "6106040049",
    "position": [-1220, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6105080019",
    "position": [-1260, 0, -470],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6102030018",
    "position": [-940, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6102030012",
    "position": [-980, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102030015",
    "position": [-1000, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102030007",
    "position": [-1040, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070010",
    "position": [-1060, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070009",
    "position": [-1100, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6102070006",
    "position": [-1080, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "滚挤标班"
  },
  {
    "id": "6101150004",
    "position": [-1120, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6101150003",
    "position": [-1160, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6101150002",
    "position": [-1140, 0, -350],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6101150001",
    "position": [-1180, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "61011030133",
    "position": [-1220, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "61011030117",
    "position": [-1220, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "61011030132",
    "position": [-1260, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "61011030134",
    "position": [-1260, 0, -350],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6101070019",
    "position": [-1300, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070021",
    "position": [-1340, 0, -380],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "磨工班"
  },
  {
    "id": "6102040006",
    "position": [-960, 0, -85],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控二班"
  },
  {
    "id": "6102040007",
    "position": [-1040, 0, -85],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "温墩班"
  },
  {
    "id": "6102040004",
    "position": [-1245, 0, -85],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第一制造部",
    "group": "温墩班"
  },
  {
    "id": "6102040005",
    "position": [-1315, 0, -85],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第一制造部",
    "group": "温墩班"
  },
  {
    "id": "6101030105",
    "position": [-950, 0, 20],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第一制造部",
    "group": "六角班"
  },
  {
    "id": "6102060036",
    "position": [-1315, 0, 20],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "数控二班"
  },
  {
    "id": "6102120067",
    "position": [-950, 0, 120],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6102120066",
    "position": [-950, 0, 160],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "冲压班"
  },
  {
    "id": "6102120077",
    "position": [-990, 0, 140],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "冲压班"
  },
  {
    "id": "6102120085",
    "position": [-1030, 0, 140],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6102120084",
    "position": [-1070, 0, 140],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": ""
  },
  {
    "id": "6102120005",
    "position": [-940, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120060",
    "position": [-976, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120004",
    "position": [-1012, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120044",
    "position": [-1048, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120006",
    "position": [-1084, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120007",
    "position": [-1120, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120008",
    "position": [-1156, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120047",
    "position": [-1192, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120046",
    "position": [-1228, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120045",
    "position": [-1264, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120078",
    "position": [-1300, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6102120074",
    "position": [-1336, 0, 240],
    "rotate": [0, 0, 0],
    "area": "第一制造部",
    "group": "热镦班"
  },
  {
    "id": "6101050001",
    "position": [-1590, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101050002",
    "position": [-1612.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030056",
    "position": [-1635, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030150",
    "position": [-1657.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030148",
    "position": [-1680, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030145",
    "position": [-1702.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030147",
    "position": [-1725, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030146",
    "position": [-1670, 0, -1065],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030149",
    "position": [-1720, 0, -1065],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030057",
    "position": [-1815, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030058",
    "position": [-1837.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030013",
    "position": [-1860, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030016",
    "position": [-1882.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030015",
    "position": [-1905, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030014",
    "position": [-1927.5, 0, -1040],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030017",
    "position": [-1860, 0, -1065],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030007",
    "position": [-1882.5, 0, -1065],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030006",
    "position": [-1905, 0, -1065],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030005",
    "position": [-1927.5, 0, -1065],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6104040010",
    "position": [-1990, 0, -1065],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6105010002",
    "position": [-1640, 0, -970],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6105010001",
    "position": [-1640, 0, -955],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102120083",
    "position": [-1760, 0, -970],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102120026",
    "position": [-1760, 0, -955],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102120031",
    "position": [-1760, 0, -925],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080013",
    "position": [-1810, 0, -970],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080018",
    "position": [-1810, 0, -955],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080017",
    "position": [-1810, 0, -940],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080007",
    "position": [-1810, 0, -925],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080009",
    "position": [-1840, 0, -955],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080005",
    "position": [-1840, 0, -940],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080006",
    "position": [-1840, 0, -925],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080004",
    "position": [-1870, 0, -955],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080010",
    "position": [-1870, 0, -940],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080015",
    "position": [-1870, 0, -925],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080011",
    "position": [-1900, 0, -955],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6102080012",
    "position": [-1900, 0, -940],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "钳工二班"
  },
  {
    "id": "6101170005",
    "position": [-1630, 0, -875],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "六角班"
  },
  {
    "id": "6101030090",
    "position": [-1630, 0, -850],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": ""
  },
  {
    "id": "6101080010",
    "position": [-1700, 0, -875],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "六角班"
  },
  {
    "id": "6101080009",
    "position": [-1700, 0, -850],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "六角班"
  },
  {
    "id": "三菱fx5u-64m-1",
    "position": [-1780, 0, -880],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": ""
  },
  {
    "id": "三菱fx5u-64m-2",
    "position": [-1790, 0, -850],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": ""
  },
  {
    "id": "6101170004",
    "position": [-1845, 0, -875],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101170006",
    "position": [-1875, 0, -875],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101170001",
    "position": [-1905, 0, -875],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101170007",
    "position": [-1845, 0, -845],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101170003",
    "position": [-1875, 0, -845],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101170002",
    "position": [-1905, 0, -845],
    "rotate": [0, 0, 0],
    "area": "第二制造部",
    "group": "钳工一班"
  },
  {
    "id": "6101040016",
    "position": [-1615, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040007",
    "position": [-1646, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040008",
    "position": [-1668, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040006",
    "position": [-1690, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040002",
    "position": [-1712, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040003",
    "position": [-1734, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040005",
    "position": [-1756, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040001",
    "position": [-1778, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101040004",
    "position": [-1800, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6106040050",
    "position": [-1915, 0, -750],
    "rotate": [0, -1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030086",
    "position": [-1600, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030091",
    "position": [-1626, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030051",
    "position": [-1652, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101080007",
    "position": [-1678, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101080008",
    "position": [-1704, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030052",
    "position": [-1730, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101080006",
    "position": [-1756, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101080005",
    "position": [-1782, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030120",
    "position": [-1808, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030121",
    "position": [-1834, 0, -675],
    "rotate": [0, 2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030054",
    "position": [-1860, 0, -675],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030053",
    "position": [-1886, 0, -675],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030055",
    "position": [-1912, 0, -675],
    "rotate": [0, -0.7853981633974483, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030001",
    "position": [-1600, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030002",
    "position": [-1629, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030003",
    "position": [-1658, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030004",
    "position": [-1687, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030104",
    "position": [-1716, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030103",
    "position": [-1745, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030102",
    "position": [-1774, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030101",
    "position": [-1803, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030111",
    "position": [-1832, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030110",
    "position": [-1861, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030109",
    "position": [-1890, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6101030108",
    "position": [-1919, 0, -635],
    "rotate": [0, -2.356194490192345, 0],
    "area": "第二制造部",
    "group": "数控一班"
  },
  {
    "id": "6102040010",
    "position": [-1610, 0, -550],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030114",
    "position": [-1650, 0, -565],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030113",
    "position": [-1650, 0, -535],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101170008",
    "position": [-1775, 0, -565],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "六角班"
  },
  {
    "id": "6101170009",
    "position": [-1775, 0, -535],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "六角班"
  },
  {
    "id": "6101030028",
    "position": [-1845, 0, -565],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030026",
    "position": [-1845, 0, -535],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030027",
    "position": [-1885, 0, -565],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6101030029",
    "position": [-1885, 0, -535],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第二制造部",
    "group": "数控二班"
  },
  {
    "id": "6102090004",
    "position": [1565, 0, -220],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "冲压班"
  },
  {
    "id": "6102090005",
    "position": [1525, 0, -220],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "冲压班"
  },
  {
    "id": "6102120061",
    "position": [1165, 0, -245],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "机加班"
  },
  {
    "id": "6102120003",
    "position": [1165, 0, -205],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "机加班"
  },
  {
    "id": "6101060005",
    "position": [1560, 0, -120],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6102030014",
    "position": [1520, 0, -120],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6107010003",
    "position": [1480, 0, -120],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "冲压班"
  },
  {
    "id": "6101070001",
    "position": [1600, 0, -95],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070011",
    "position": [1560, 0, -95],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070016",
    "position": [1520, 0, -95],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6107010002",
    "position": [1480, 0, -95],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "冲压班"
  },
  {
    "id": "6101030060",
    "position": [1530, 0, -25],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101040011",
    "position": [1440, 0, -25],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "冲压班"
  },
  {
    "id": "6101030131",
    "position": [1370, 0, -25],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030130",
    "position": [1350, 0, -25],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101040017",
    "position": [1330, 0, -25],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030032",
    "position": [1600, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030030",
    "position": [1580, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030031",
    "position": [1560, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030061",
    "position": [1540, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030059",
    "position": [1520, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030062",
    "position": [1500, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101040010",
    "position": [1480, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101040009",
    "position": [1460, 0, -5],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101060043",
    "position": [1600, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060044",
    "position": [1560, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060045",
    "position": [1520, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060046",
    "position": [1480, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101070008",
    "position": [1440, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060022",
    "position": [1350, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060012",
    "position": [1300, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6101060021",
    "position": [1260, 0, 315],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第三制造部",
    "group": "磨工班"
  },
  {
    "id": "6102060031",
    "position": [1580, 0, -820],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060006",
    "position": [1500, 0, -820],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060033",
    "position": [1385, 0, -805],
    "rotate": [0, 0, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "s7-200smart",
    "position": [1305, 0, -820],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6102060023",
    "position": [1585, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060002",
    "position": [1529, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060001",
    "position": [1473, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060004",
    "position": [1417, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060005",
    "position": [1361, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102060003",
    "position": [1305, 0, -615],
    "rotate": [0, 0.7853981633974483, 0],
    "area": "第五制造部",
    "group": "螺钉班"
  },
  {
    "id": "6102030008",
    "position": [1495, 0, -515],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6102030009",
    "position": [1428, 0, -515],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6102030011",
    "position": [1360, 0, -515],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6107010005",
    "position": [1330, 0, -515],
    "rotate": [0, 0, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6102070008",
    "position": [1300, 0, -545],
    "rotate": [0, 0, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6107010008",
    "position": [1300, 0, -520],
    "rotate": [0, 0, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6107010001",
    "position": [1320, 0, -495],
    "rotate": [0, 0, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6102020003",
    "position": [1600, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": "滚挤钳班"
  },
  {
    "id": "6101050004",
    "position": [1574, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": "机加班"
  },
  {
    "id": "6101050005",
    "position": [1548, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": "机加班"
  },
  {
    "id": "6101050033",
    "position": [1522, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050034",
    "position": [1496, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050012",
    "position": [1470, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050013",
    "position": [1444, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050018",
    "position": [1418, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050019",
    "position": [1392, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050123",
    "position": [1366, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6101050122",
    "position": [1340, 0, -415],
    "rotate": [0, 1.5707963267948966, 0],
    "area": "第五制造部",
    "group": ""
  },
  {
    "id": "6103110012",
    "position": [-1640, 0, -255],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103040002",
    "position": [-1730, 0, -255],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": ""
  },
  {
    "id": "6103110011",
    "position": [-1820, 0, -255],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103040001",
    "position": [-1880, 0, -255],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010024",
    "position": [-1600, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": ""
  },
  {
    "id": "6103010023",
    "position": [-1645, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103100001",
    "position": [-1690, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010022",
    "position": [-1735, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010006",
    "position": [-1780, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010009",
    "position": [-1825, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010010",
    "position": [-1870, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103030001",
    "position": [-1920, 0, -165],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010003",
    "position": [-1600, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010004",
    "position": [-1660, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010005",
    "position": [-1720, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010021",
    "position": [-1780, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010014",
    "position": [-1860, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010013",
    "position": [-1920, 0, -60],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010012",
    "position": [-1800, 0, 45],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010019",
    "position": [-1755, 0, 155],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010015",
    "position": [-1815, 0, 155],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010016",
    "position": [-1875, 0, 155],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010020",
    "position": [-1670, 0, 250],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010017",
    "position": [-1750, 0, 250],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6103010018",
    "position": [-1875, 0, 250],
    "rotate": [0, 3.141592653589793, 0],
    "area": "第四制造部",
    "group": "热处理"
  },
  {
    "id": "6101030128",
    "position": [0, 0, -1100],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030129",
    "position": [0, 0, -1130],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030135",
    "position": [50, 0, -1070],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030136",
    "position": [50, 0, -1100],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030137",
    "position": [155, 0, -1070],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030138",
    "position": [155, 0, -1100],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030139",
    "position": [120, 0, -1070],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030140",
    "position": [85, 0, -1070],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030096",
    "position": [160, 0, -1240],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030097",
    "position": [130, 0, -1240],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030093",
    "position": [100, 0, -1300],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030106",
    "position": [50, 0, -1300],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "数车班"
  },
  {
    "id": "6101030141",
    "position": [155, 0, -1130],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030142",
    "position": [130, 0, -1300],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030143",
    "position": [135, 0, -1130],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101030144",
    "position": [160, 0, -1300],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6102120055",
    "position": [60, 0, -1240],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  // {
  //   "id": "6102120081",
  //   "position": [],
  //   "rotate": [0, -Math.PI / 2, 0],
  //   "area": "第三制造部",
  //   "group": ""
  // },
  {
    "id": "6102080016",
    "position": [140, 0, -800],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6102080019",
    "position": [100, 0, -800],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6102130002",
    "position": [30, 0, -1240],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101060052",
    "position": [-10, 0, -1300],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
  {
    "id": "6101190001",
    "position": [-55, 0, -1240],
    "rotate": [0, -Math.PI / 2, 0],
    "area": "第三制造部",
    "group": "双线螺栓"
  },
]




const deviceIdTypeMap = [{
  type: 1,
  modelName: '6101060050',
  id: ['6101060050'],
  scale: 400
}, {
  type: 2,
  modelName: '6101070018-santai',
  id: ['6101070018', '6101070022', '6101070020'],
  scale: 400
}, {
  type: 3,
  modelName: '6101060016',
  id: ['6101060016', '6101060020', '6101060018'],
  scale: 400
}, {
  type: 4,
  modelName: '6101070007-liangtai',
  id: ['6101070007', '6101070002', '6101070014'],
  scale: 400
}, {
  type: 5,
  modelName: '6101070009-liutai',
  id: ['6101060043', '6101060044', '6101060045', '6101060046', '6101070008', '6101070009', '6101070005', '6101070006', '6101070004', '6101070017', '6101070003'],
  scale: 400
}, {
  type: 7,
  modelName: '6101030050-48-49',
  id: ['6101030050', '6101030048', '6101030049'],
  scale: 400
}, {
  type: 8,
  modelName: '6101030020-21',
  id: ['6101030020', '6101030021'],
  scale: 400
}, {
  type: 9,
  modelName: '6101030083-sitai',
  id: ['6101030083', '6101030078', '6101030077', '6101030076'],
  scale: 400
}, {
  type: 10,
  modelName: '6101030072-71',
  id: ['6101030072', '6101030071'],
  scale: 400
}, {
  type: 11,
  modelName: '6101030025-liutai',
  id: ['6101030025', '6101030024', '6101030023', '6101030022', '6101030099', '6101030100'],
  scale: 400
}, {
  type: 12,
  modelName: '6101030038-jiutai',
  id: ['6101030093', '6101030106', '6101030141', '6101030144', '6101030129', '6101030135', '6101030136', '6101030137', '6101030138', '6101030139', '6101030140', '6101030096', '6101030097', '6101030115', '6101030116', '6101030128', '6101030032', '6101030030', '6101030031', '6101030061', '6101050122', '6101050123', '6101050033', '6101050034', '6101030038', '6101030037', '6101030036', '6101030035', '6101030040', '6101030039', '6101030092', '6101030125', '6101030124', '6101030150'],
  scale: 400
}, {
  type: 13,
  modelName: '6102020007-liangtai',
  id: ['6102020007', '6102030013'],
  scale: 400
}, {
  type: 14,
  modelName: '6102020003',
  id: ['6102020009', '6102010002', '6102020005', '6102020004'],
  scale: 400
}, {
  type: 15,
  modelName: '6102060031',
  id: ['6102060031'],
  scale: 400
}, {
  type: 16,
  modelName: '6102060006',
  id: ['6102060006'],
  scale: 400
}, {
  type: 17,
  modelName: '6102060033',
  id: ['6102060033'],
  scale: 400
}, {
  type: 18,
  modelName: 's7-200smart',
  id: ['s7-200smart'],
  scale: 400
}, {
  type: 19,
  modelName: '6102060023',
  id: ['6102060023'],
  scale: 400
}, {
  type: 20,
  modelName: '6102060002',
  id: ['6102060002', '6102060001', '6102060004', '6102060005', '6102060003'],
  scale: 400
}, {
  type: 21,
  modelName: '6102030008',
  id: ['6102030008', '6102030009', '6102030011'],
  scale: 400
}, {
  type: 22,
  modelName: '6101050012',
  id: ['6101050012', '6101050013'],
  scale: 400
}, {
  type: 24,
  modelName: '6102020003',
  id: ['6102020003'],
  scale: 400
}, {
  type: 25,
  modelName: '6101050004',
  id: ['6101050004', '6101050005', '6101050001', '6101050002'],
  scale: 400
}, {
  type: 26,
  modelName: '6107010005',
  id: ['6107010005', '6107010008'],
  scale: 400
}, {
  type: 27,
  modelName: '6107010001',
  id: ['6107010001'],
  scale: 400
}, {
  type: 28,
  modelName: '6102010009',
  id: ['6102010009'],
  scale: 400
}, {
  type: 29,
  modelName: '6104040010',
  id: ['6104040010'],
  scale: 200
}, {
  type: 30,
  modelName: '6102010016',
  id: ['6102010016'],
  scale: 400
}, {
  type: 31,
  modelName: '6102030010',
  id: ['6102030010'],
  scale: 400
}, {
  type: 32,
  modelName: '6102120080-79',
  id: ['6102080019', '6102130002', '6101060052', '6101190001', '6102130002', '6102120055', '6102120080', '6102120079'],
  scale: 400
}, {
  type: 33,
  modelName: '6102120056',
  id: ['6102120056'],
  scale: 400
}, {
  type: 34,
  modelName: '6102070005_1',
  id: ['6102070005', '6102130001', '6102070002', '6102130004', '6102130003'],
  scale: 400
}, {
  type: 35,
  modelName: '6102070001_1',
  id: ['6102070001', '6102070011'],
  scale: 400
}, {
  type: 36,
  modelName: 'p-xhc60t',
  id: ['p-xhc60t-1', 'p-xhc60t-2'],
  scale: 400
}, {
  type: 37,
  modelName: '6101030067',
  id: ['6101030067', '6101030068', '6101030069', '6101030070'],
  scale: 400
}, {
  type: 38,
  modelName: '6101030126-sitai',
  id: ['6101030126', '6101030127', '6101030094', '6101030095'],
  scale: 400
}, {
  type: 39,
  modelName: '6106040049',
  id: ['6106040049', '6105080019'],
  scale: 400
}, {
  type: 40,
  modelName: '6101050007-08',
  id: ['6101050007', '6101050008'],
  scale: 400
}, {
  type: 41,
  modelName: '6101040014',
  id: ['6101040014'],
  scale: 400
}, {
  type: 42,
  modelName: '6102030018',
  id: ['6102030018'],
  scale: 400
}, {
  type: 43,
  modelName: '6102030012',
  id: ['6102030012', '6102030015', '6102030007'],
  scale: 400
}, {
  type: 44,
  modelName: '6102070010',
  id: ['6102070010', '6102070009', '6102070006'],
  scale: 400
}, {
  type: 45,
  modelName: '6101150004-03-02',
  id: ['6101150004', '6101150003', '6101150002'],
  scale: 400
}, {
  type: 46,
  modelName: '6101150001',
  id: ['6101150001'],
  scale: 400
}, {
  type: 47,
  modelName: '61011030133',
  id: ['61011030133', '61011030117', '61011030132', '61011030134'],
  scale: 400
}, {
  type: 48,
  modelName: '6101070019-21',
  id: ['6101070019', '6101070021'],
  scale: 400
}, {
  type: 49,
  modelName: '6102040005',
  id: ['6102040007', '6102040004', '6102040005'],
  scale: 400
}, {
  type: 50,
  modelName: '6102040006',
  id: ['6102040006'],
  scale: 400
}, {
  type: 51,
  modelName: '6101030105',
  id: ['6101030105'],
  scale: 400
}, {
  type: 52,
  modelName: '6102060036',
  id: ['6102060036'],
  scale: 400
}, {
  type: 53,
  modelName: '6102120067-66',
  id: ['6102120067', '6102120066'],
  scale: 400
}, {
  type: 54,
  modelName: 'JH21-80',
  id: ['6102120077', '6102120004', '6102120044', '6102120006'],
  scale: 400
}, {
  type: 55,
  modelName: 'JH21-125',
  id: ['6102120085', '6102120007', '6102120008', '6102120047'],
  scale: 400
}, {
  type: 56,
  modelName: 'JH21-63',
  id: ['6102120061', '6102120003', '6102120084', '6102120046', '6102120045', '6102120078'],
  scale: 400
}, {
  type: 57,
  modelName: 'JH21-315B',
  id: ['6102120005', '6102120074'],
  scale: 400
}, {
  type: 58,
  modelName: 'XD',
  id: ['6102120060'],
  scale: 400
}, {
  type: 59,
  modelName: '6101030013',
  id: ['6101050018', '6101050019', '6101030013', '6101030016', '6101030015', '6101030014', '6101030017', '6101030007', '6101030006', '6101030005', '6101030028', '6101030026', '6101030027', '6101030029'],
  scale: 200
}, {
  type: 60,
  modelName: '6101030058',
  id: ['6101030057', '6101030058'],
  scale: 200
}, {
  type: 61,
  modelName: '6101030143-142-141',
  id: ['6101030143', '6101030142', '6101030141'],
  scale: 200
}, {
  type: 62,
  modelName: '6101030147',
  id: ['6101030148', '6101030145', '6101030147', '6101030146', '6101030149'],
  scale: 200
}, {
  type: 63,
  modelName: '6102080014',
  id: ['6102080018', '6102080017', '6102080007', '6102080006', '6102080015', '6102080014'],
  scale: 200
}, {
  type: 64,
  modelName: '6101030056',
  id: ['6101030056'],
  scale: 200
}, {
  type: 65,
  modelName: '6105010002',
  id: ['6105010002', '6105010001'],
  scale: 200
}, {
  type: 66,
  modelName: '6102120026_01',
  id: ['6102120026', '6102120031'],
  scale: 200
}, {
  type: 67,
  modelName: '6102120083',
  id: ['6102120083'],
  scale: 200
}, {
  type: 68,
  modelName: '6102080013',
  id: ['6102080013'],
  scale: 200
}, {
  type: 69,
  modelName: '6102080009',
  id: ['6102080009'],
  scale: 200
}, {
  type: 70,
  modelName: '6102080005',
  id: ['6102080005', '6102080004', '6102080010', '6102080011', '6102080012'],
  scale: 200
}, {
  type: 71,
  modelName: '6101170004',
  id: ['6101170004', '6101170006', '6101170001', '6101170007', '6101170003', '6101170002'],
  scale: 200
}, {
  type: 72,
  modelName: '三菱fx5u-64m',
  id: ['三菱fx5u-64m-1', '三菱fx5u-64m-2'],
  scale: 200
}, {
  type: 73,
  modelName: '6101080010',
  id: ['6101080010', '6101080009'],
  scale: 200
}, {
  type: 74,
  modelName: '6101030090',
  id: ['6101030090'],
  scale: 200
}, {
  type: 75,
  modelName: '6101170005',
  id: ['6101170005'],
  scale: 200
}, {
  type: 76,
  modelName: '6101040016',
  id: ['6101030131', '6101030130', '6101040017', '6101040016'],
  scale: 200
}, {
  type: 77,
  modelName: '6101040007-08',
  id: ['6101040007', '6101040008'],
  scale: 200
}, {
  type: 78,
  modelName: '6101040006',
  id: ['6101040006', '6101040002', '6101040003', '6101040005', '6101040001', '6101040004'],
  scale: 200
}, {
  type: 79,
  modelName: '6106040050',
  id: ['6106040050'],
  scale: 200
}, {
  type: 80,
  modelName: '6101030054-53-55',
  id: ['6101030054', '6101030053', '6101030055'],
  scale: 150
}, {
  type: 81,
  modelName: '6101030086',
  id: ['6101030086', '6101030091', '6101030051', '6101080007', '6101080008', '6101030052', '6101080006', '6101080005', '6101030120', '6101030121', '6101030001', '6101030002', '6101030003', '6101030004', '6101030104', '6101030103', '6101030102', '6101030101', '6101030111', '6101030110', '6101030109', '6101030108'],
  scale: 150
}, {
  type: 82,
  modelName: '6102040010',
  id: ['6102040010'],
  scale: 200
}, {
  type: 83,
  modelName: '6101030114',
  id: ['6101030114', '6101030113'],
  scale: 200
}, {
  type: 84,
  modelName: '6101170008',
  id: ['6101170008', '6101170009'],
  scale: 200
}, {
  type: 86,
  modelName: '6102090004',
  id: ['6102090004', '6102090005'],
  scale: 400
}, {
  type: 87,
  modelName: '6101060005',
  id: ['6101060005'],
  scale: 400
}, {
  type: 88,
  modelName: '6102030014',
  id: ['6102030014'],
  scale: 400
}, {
  type: 89,
  modelName: '6101070001',
  id: ['6101070001'],
  scale: 400
}, {
  type: 90,
  modelName: '6101070011',
  id: ['6101070011'],
  scale: 400
}, {
  type: 91,
  modelName: '6101070016',
  id: ['6101070016'],
  scale: 400
}, {
  type: 92,
  modelName: '6107010002',
  id: ['6107010002'],
  scale: 400
}, {
  type: 93,
  modelName: '6101030060',
  id: ['6101030060'],
  scale: 400
}, {
  type: 94,
  modelName: '6101030062',
  id: ['6101030062', '6101030059'],
  scale: 400
}, {
  type: 95,
  modelName: '6101040011',
  id: ['6101040011', '6101040010'],
  scale: 400
}, {
  type: 96,
  modelName: '6101040009',
  id: ['6101040009'],
  scale: 400
}, {
  type: 97,
  modelName: '6107010003',
  id: ['6107010003'],
  scale: 400
}, {
  type: 103,
  modelName: '6101060022',
  id: ['6101060022'],
  scale: 300
}, {
  type: 104,
  modelName: '6101060012',
  id: ['6101060012'],
  scale: 300
}, {
  type: 105,
  modelName: '6101060021',
  id: ['6101060021'],
  scale: 300
}, {
  type: 106,
  modelName: '6101060022',
  id: ['6101060022'],
  scale: 300
}, {
  type: 107,
  modelName: '6103040002',
  id: ['6103040002'],
  scale: 300
}, {
  type: 108,
  modelName: '6103110011',
  id: ['6103110011'],
  scale: 300
}, {
  type: 109,
  modelName: '6103010014',
  id: ['6103010014'],
  scale: 300
}, {
  type: 110,
  modelName: '6103040001',
  id: ['6103040001', '6103030001'],
  scale: 300
}, {
  type: 111,
  modelName: '61030100001',
  id: ['6103100001'],
  scale: 300
}, {
  type: 112,
  modelName: '6103010022',
  id: ['6103010022', '6103010023'],
  scale: 300
}, {
  type: 113,
  modelName: '61030100001',
  id: ['61030100001', '6103010017', '6103010018'],
  scale: 300
}, {
  type: 114,
  modelName: '6103010010',
  id: ['6103010010', '6103010006'],
  scale: 300
}, {
  type: 115,
  modelName: '6103010009',
  id: ['6103010009'],
  scale: 300
}, {
  type: 116,
  modelName: '6103010003_6103010015',
  id: ['6103010003'],
  scale: 300
}, {
  type: 117,
  modelName: '6103010004',
  id: ['6103010004'],
  scale: 54.9
}, {
  type: 118,
  modelName: '6103010005',
  id: ['6103010005'],
  scale: 300
}, {
  type: 119,
  modelName: '6103010021',
  id: ['6103010021'],
  scale: 300
}, {
  type: 120,
  modelName: '6103010013',
  id: ['6103010013'],
  scale: 300
}, {
  type: 121,
  modelName: '6103010012',
  id: ['6103010012'],
  scale: 300
}, {
  type: 122,
  modelName: '6103010019',
  id: ['6103010024,', '6103010019', '6103010015', '6103010016'],
  scale: 300
}, {
  type: 123,
  modelName: '6103010020',
  id: ['6103010020'],
  scale: 300
}]

window.deviceMap = deviceMap
window.deviceIdTypeMap = deviceIdTypeMap